Repository: vkradio/FashionStore
Catalog: src/FashionStoreWinForms/Properties/Resources.*.resx
Languages: ru

# ALL_WAREHOUSES_SHORT
source: all WHs
ru: все точки

# APP_BRAND
source: Fashion Store
ru: Магазин одежды

# ASK_CANCEL_SALE
source: Cancel sale of "{0}" with price of {1}?
ru: Отменить продажу "{0}" на сумму {1} р.?

# ASK_DELETE_OBJECT
source: Delete object?
ru: Удалить объект?

# ASK_DELETE_SKU
source: WARNING! Do you wish to remove all SKU "{0}" with purchasing price of {1}? If this SKU is not present in any other warehouses, it will be completely removed.
ru: ВНИМАНИЕ! Действительно удалить весь товар "{0}" с закупочной ценой {1}? Также будет удален артикул, если он больше нигде не используется.

# ASK_PROCEED_AND_ABANDON_FORM_DATA
source: The form can have unsaved data. Proceed with new action?
ru: На форме могут оставаться несохраненные данные. Выполнить новое действие?

# ASK_RESET_ALL_ENTERED_VALUES
source: Reset all entered values?
ru: Сбросить все введенные значения?

# ASK_SHOW_ALL_SKUS_IN_THIS_STOCK
source: Show the full list of SKUs in this stock?
ru: Будет выведен полный список товара на точке. Продолжить?

# ASK_WHETHER_TO_CREATE_NEW_SKU
source: No such SKU. Start creating new SKU with such name?
ru: Такого артикула нет. Начать оформление нового с таким наименованием?

source: Attention
ru: Внимание

# ATTENTION_ZERO_PRICE
source: ATTENTION! The price is 0, so item is sold for free.
ru: ВНИМАНИЕ! Цена 0, т.е. товар продается бесплатно.

source: Backup completed.
ru: Резервное копирование завершено.

# BACKUP_FOLDER_NOT_EXISTS
source: Backup storage device is not attached.
ru: Не вставлен съемный диск для резервного копирования.

# BACKUP_FOLDER_NOT_SET
source: Backup folder is not set in the program settings.
ru: В настройках программы не задана папка резервного копирования.

source: Cancelation
ru: Отмена

source: Choose backup folder
ru: Выберите папку резервного хранения

# CLICK_TO_VIEW_SELL_MOVE_SKU
source: Click here to view, sell or move SKU ({0})
ru: Нажмите сюда, чтобы посмотреть товар, продать или перебросить ({0})

source: Confirmation
ru: Подтверждение

# CONFIRM_MOVING_GOODS
source: Move {1} units of SKU "{0}" to warehouse {3}?
ru: Перебросить товар "{0}" в количестве {1} ед. на точку {2}?

# CONFIRM_SELECTED_DATE
source: {0} of {1} has been selected. Continue?
ru: Выбрана дата: {0} {1} Вы уверены?

# COST_OF_PURCHASE_SHORT
source: Purch.cost
ru: Цена закуп.

source: Critical error
ru: Критическая ошибка

# CRITICAL_ERROR_MSG_COMMON1
source: Critical error happened. This application will be closed now.
ru: Произошла критическая ошибка. Приложение сейчас будет закрыто.

# CRITICAL_ERROR_MSG_COMMON2
source: This will help to find and fix the defect.
ru: Это поможет найти и исправить дефект.

# CRITICAL_ERROR_MSG_DESCRIBE_ACTIONS
source: Please describe to the developer your actions right before this error happened.
ru: Пожалуйста, опишите ваши действия, после которых это произошло, разработчику программы.

# CRITICAL_ERROR_MSG_SEND_FILE
source: Please send the file which you'll see now, to the developer, with description of your actions right before this error happened.
ru: Пожалуйста, отправьте файл, который сейчас увидите, с описанием ваших действий, после которых это произошло, разработчику программы.

source: Current warehouse not selected.
ru: Не выбрана текущая точка продаж.

# ERR_PART_CELL_QTY
source: Allowed only integer positive number.
ru: Допустимо только положительное целое число.

# ERR_PART_PRICE
source: Allowed only integer (without cents) non-negative number.
ru: Допустимо только целое неотрицательное число в рублях.

source: Failure
ru: Отказ

# FOUND_TOO_MUCH
source: {0} SKUs has been found. Because of memory constraints, it will be shown only {1} of them. For viewing all needed SKUs, please enter more precise search query.
ru: Найдено {0} позиций. Из-за ограничений памяти будет выведено показано только {1} из них. Для отображения всех нужных позиций вводите более точный поисковый запрос.

source: Goods has been moved.
ru: Товар перемещен.

source: Invalid cost of purchase.
ru: Неверное значение цены закупки.

# INVALID_COST_OF_PURCHASE_EXPLAINED
source: Invalid cost of purchase. It should be an integer non-negative number.
ru: Цена закупки задана неверно. Допустимо целое неотрицательное число.

source: Invalid ID.
ru: Неверный ID.

# INVALID_SELL_PRICE
source: Invalid planned sell price.
ru: Неверное значение плановой цены продажи.

# INVALID_SKU_QTY_IS_ENTERED
source: Invalid SKU quantity is entered.
ru: Задано неверное количество товара.

# INVALID_SKU_QTY_IS_ENTERED_IN_CELL
source: Invalid SKU quantity is entered in cell {0}:{1}.
ru: Задано неверное количество товара в ячейке {0}:{1}.

# INVALID_UNIT_PRICE_OF_SELL
source: Invalid price of sell per unit entered.
ru: Указана неверная цена продажи.

source: Message
ru: Сообщение

source: Name not set.
ru: Не задано наименование.

# NEW_DATE_IS_SAME_AS_OLD_ONE_SO_CHANGE_NOTHING
source: New date is the same as an old one, so we change nothing.
ru: Новая дата совпадает со старой, оставляем все без изменений.

# NOTHING_FOUND
source: Nothing has been found.
ru: Ничего не найдено.

source: No row selected.
ru: Не выбрана строка.

source: Object not found.
ru: Объект не найден.

# PATH_TO_DB_NOT_SET
source: Path to database is not set in settings.
ru: Не задан путь к БД в настройках.

# PRICE_OF_STOCKS_SHORT
source: Price stocks
ru: Цена остаток

# PROGRAM_ALREADY_LAUCHED
source: The program "{0}" is already launched. Probably, you clicked on its launcher twice.
ru: Программа "{0}" уже запущена. Вы нажали, возможно, случайно, запуск дважды.

# PROGRAM_AND_VERSION
source: {0} ver.{1}
ru: {0} версия {1}

# QTY_SHORT
source: Qty
ru: Кол-во

# QTY_TOO_BIG_FOR_GIVEN_CELL
source: SKU quantity is too big, there is no such amount goods in this cell.
ru: Указано слишком большое количество, в ячейке столько нет.

source: Question
ru: Вопрос

source: Question about date
ru: Вопрос по дате

# SALES_SUMMARY_LABEL
source: Sales number: {0} Sum: {1} Profit: {2}
ru: Продаж: {0} Сумма: {1} Прибыль: {2}

# SELL_PRICE_SHORT
source: Sell price
ru: Цена продажи

source: Sizes
ru: Размеры

source: SKU
ru: Артикул

source: SKU has been saved.
ru: Товар сохранён.

# SKU_IN_STOCK
source: SKU in stock ({0})
ru: Товар в наличии ({0})

# SOME_SETTINGS_REQUIRE_TO_RELOAD_PROGRAM
source: Some settings require to reload the program to take effect.
ru: Некоторые настройки требуют перезапуска программы для вступления в силу.

source: Total
ru: Всего

# TOTALS_CAP
source: TOTALS
ru: ИТОГО

# UNABLE_DELETE_OBJECT_HAS_CHILDREN
source: Unable to delete object, it has subordinate objects.
ru: Невозможно удалить объект, у него имеются подчиненные объекты.

# UNABLE_DELETE_OBJECT_TECHNICAL_CODE
source: Unable to delete object. Technical failure code: {0}.
ru: Не удалось удалить объект. Технический код отказа: {0}.

# UNABLE_TO_CREATE_REPORT_LONG
source: Unable to save a report file. Probably, its old copy is opened by another program - if so, you need to close it first. If it do not help, try to reboot your computer (or switch it off and then on).
ru: Не удается сохранить отчет. Возможно, сейчас открыта его старая копия - ее нужно закрыть. Если ничего не помогает, нужно перезагрузить (выключить и затем снова включить) компьютер.

# WARNING_EXCLAMATION
source: Warning!
ru: Внимание!

# WILL_BE_SOLD_DETAILS
source: Will be sold {0} units of "{1}" with price of {2} per unit.
ru: Будет продано {0} ед. товара "{1}" по цене {2} р. за ед.
