Repository: vkradio/FashionStore
Catalog: src/FashionStoreWinForms/Forms/FRM_Main.*.resx
Languages: ru

# MI_Cards.Text
source: Cards
ru: Карточки

# MI_Settings.Text
source: Settings
ru: Настройки

# MI_AddSku.Text
source: Add SKU
ru: Добавть товар

# MI_SearchSku.Text
source: Search
ru: Поиск

# MI_SalesJournal.Text
source: Sales history
ru: Журнал продаж

# MI_Report.Text
source: Reports
ru: Отчёты

# MI_DressMatrix.Text
source: Size chart layout
ru: Тип сетки

# MI_Card_PointOfSale.Text
source: Store
ru: Точка продаж

# MI_Sql.Text
source: SQL commands
ru: Команды SQL

# MI_UserSettings.Text
source: User settings
ru: Пользовательские настройки

# MI_Backup.Text
source: Backup
ru: Резервное копирование

# MI_Rep_PerPos.Text
source: Stocks per store
ru: Остатки по точкам

# MI_Rep_Total.Text
source: Stocks overall
ru: Остатки всего
